backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_3, 0, 0]
  - [user_matrix, 0, 0]
  - [observed_image, 0, 0]
  - [non_observed_image, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 1]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_0_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_0_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_1_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_1_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_2_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_2_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_3_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_3_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_4_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_4_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_5_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_5_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_6_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_6_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_7_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_7_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_8_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_8_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_9_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_9_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_10_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_10_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_11_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_11_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_12_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_12_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_13_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_13_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_14_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_14_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_15_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_15_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_16_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_16_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_17_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_17_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_18_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_18_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_19_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_19_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_20_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_20_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_21_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_21_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_22_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_22_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_23_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_23_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_24_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_24_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_25_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_25_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_26_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_26_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_27_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_27_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_28_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_28_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_29_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_29_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_30_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_30_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_31_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_31_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_32_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_32_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_33_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_33_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_34_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_34_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_35_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_35_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_36_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_36_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_37_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_37_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_38_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_38_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_39_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_39_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_40_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_40_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_41_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_41_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_42_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_42_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_43_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_43_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_44_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_44_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_45_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_45_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_46_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_46_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_47_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_47_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_48_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_48_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_49_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_49_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_50_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_50_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_51_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_51_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_52_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_52_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_53_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_53_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_54_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_54_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_55_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_55_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_56_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_56_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_57_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_57_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_58_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_58_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_59_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_59_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_60_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_60_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_61_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_61_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_62_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_62_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_63_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_63_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_64_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_64_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_65_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_65_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_66_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_66_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_67_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_67_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_68_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_68_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_69_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_69_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_70_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_70_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 1.0}
      name: user_71_preferences
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: user_71_preferences
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: RandomNormal
        config: {mean: 0.0, seed: null, stddev: 0.05}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
